## Pandas 

It is a powerful data manipulation library in python. Widely used for data analysis and data cleaning. it provides two primary Data Structures : `series` and  `DataFrame` . 

A series is a one-dimensional Array like- object.

While A data frame is a two-dimensional ,Size-mutable and potentially hetrogeneous[different elemenets] tabular data structure with labeled axes (Row and column).

In [ ]:
# %pip install pandas

Collecting pandas
  Downloading pandas-2.2.3-cp312-cp312-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in d:\machine learning\python\venv\lib\site-packages (from pandas) (2.2.5)
Requirement already satisfied: python-dateutil>=2.8.2 in d:\machine learning\python\venv\lib\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in d:\machine learning\python\venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.2.3-cp312-cp312-win_amd64.whl (11.5 MB)
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   ------ --------------------------------- 1.8/11.5 MB 12.6 MB/s eta 0:00:01
   -------------------------------- ------- 9.4/11.5 MB 26.7 MB/s eta 0:00:01
   ---------------------------------------- 11.5/11.5 MB 24.0 MB/s eta 0:00:00
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Downloading tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.3 pytz-2025.2 tzdata-2025.2
Note: you may need to restart the kernel to use updated packages.

In [ ]:
import pandas as pd

## Series - Like 1D array can hold any data-type return indies also 

data = [12,3,4,5,6,3]; 
series = pd.Series(data); 
print(series)

0    12
1     3
2     4
3     5
4     6
5     3
dtype: int64

In [ ]:
## Create series from dictornies 

data = {'a ': 1, 'b':2, 'c' : 3}; # in dictornies key become indies 
dic = pd.Series(data)
print(dic)

a     1
b     2
c     3
dtype: int64

In [ ]:
sata = [10,20,30]; 
index = ['a', 'b', 'c'];  # custom indies 

pd.Series(sata,index)

a    10
b    20
c    30
dtype: int64

In [ ]:
# data - frame = 2d array 

data_frame = {
  'name' : ['ayush','Kumar','sahu', 'vishal'], 
  'age': [12,7,56,23],
  'city' : ['ip', 'vai', 'khora', 'bhapur']
} 

print(data_frame)

df = pd.DataFrame(data_frame); # this converted it into a tabular data form 

print(df)

{'name': ['ayush', 'Kumar', 'sahu', 'vishal'], 'age': [12, 7, 56, 23], 'city': ['ip', 'vai', 'khora', 'bhapur']}
     name  age    city
0   ayush   12      ip
1   Kumar    7     vai
2    sahu   56   khora
3  vishal   23  bhapur

In [ ]:
import numpy as np

np.array(df) ## intoo a 2d matrix

array([['ayush', 12, 'ip'],
       ['Kumar', 7, 'vai'],
       ['sahu', 56, 'khora'],
       ['vishal', 23, 'bhapur']], dtype=object)

In [16]:
## Creating a Data frame from a List of Dictionaries
 
data_frame = [
  {'Name' : 'Ayush', 'Age':22 , 'City' : 'IP'},
  {'Name' : 'Anuj', 'Age':23 , 'City' : 'Bhapur'},
  {'Name' : 'Sahu', 'Age':24 , 'City' : 'Vaisali'},
]  


# for d in data_frame:
#   print(d)

df = pd.Series(data_frame); 
print(df)

0        {'Name': 'Ayush', 'Age': 22, 'City': 'IP'}
1     {'Name': 'Anuj', 'Age': 23, 'City': 'Bhapur'}
2    {'Name': 'Sahu', 'Age': 24, 'City': 'Vaisali'}
dtype: object

In [20]:
df = pd.read_csv('sales_data.csv')
df.head(4)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card

In [19]:
df.tail(4)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [ ]:
df['Date'] ## we can directly call the column name to get its all values  - it become a series because it's a single row

0      2024-01-01
1      2024-01-02
2      2024-01-03
3      2024-01-04
4      2024-01-05
          ...
235    2024-08-23
236    2024-08-24
237    2024-08-25
238    2024-08-26
239    2024-08-27
Name: Date, Length: 240, dtype: object

In [ ]:
df.loc[0]  ## Row index

Transaction ID              10001
Date                   2024-01-01
Product Category      Electronics
Product Name        iPhone 14 Pro
Units Sold                      2
Unit Price                 999.99
Total Revenue             1999.98
Region              North America
Payment Method        Credit Card
Name: 0, dtype: object

In [23]:
df.iloc[0] ## column index

Transaction ID              10001
Date                   2024-01-01
Product Category      Electronics
Product Name        iPhone 14 Pro
Units Sold                      2
Unit Price                 999.99
Total Revenue             1999.98
Region              North America
Payment Method        Credit Card
Name: 0, dtype: object

In [ ]:
df.loc[0][1] ## index in a column

C:\Users\pawar\AppData\Local\Temp\ipykernel_17720\395987507.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][1]

'2024-01-01'

In [34]:
## Accessing a specfic element

In [46]:


# Creating DataFrame
data_frame = [  
  {'Name': 'Ayush', 'Age': 22, 'City': 'IP'},  
  {'Name': 'Anuj', 'Age': 23, 'City': 'Bhapur'},  
  {'Name': 'Sahu', 'Age': 24, 'City': 'Vaisali'}  
]  
df = pd.DataFrame(data_frame)  

# Adding a new column  
df['salary'] = [5000, 3200, 3300]  
# print("Before dropping:\n", df)  

# Correctly dropping the column  

df.drop('salary', axis=1, inplace=True)  
## these two are important to get the working of drop 

## inplace = true - now it is permenant work, beacuse drop is a temporary operations


# print("After dropping:\n", df)


df['Age'] = df['Age']+1
print(df)

    Name  Age     City
0  Ayush   23       IP
1   Anuj   24   Bhapur
2   Sahu   25  Vaisali